{
  "story_state": {
    "characters": {},
    "current_scene": {},
    "inventory": [],
    "visited_nodes": [
      "node_0"
    ],
    "theme": "star wars",
    "max_depth": 3
  },
  "graph": {
    "nodes": {
      "node_0": {
        "story": "The harsh Ryloth sun beats down on your weathered face as you sift through the wreckage of a downed TIE fighter. Years of scavenging have honed your mechanical skills and instincts for survival under the oppressive Imperial occupation. The Empire's presence is a constant weight, crushing the Twi'lek people under its boot. You're mostly concerned with keeping your head down and finding enough scrap to trade for food and fuel, until a broken datapad catches your eye. It flickers with a faint, distorted image and a garbled message - a plea for help from a hidden Rebel cell on the brink of annihilation. Something about the message resonates deep within you, stirring long-dormant feelings of resistance and a sense of destiny you can't quite explain.",
        "is_end": false,
        "dialogue": "",
        "scene_state": {
          "location": "unknown",
          "time_of_day": "day",
          "weather": "clear",
          "ambient": "mysterious"
        },
        "characters": {
          "player": {
            "health": 100,
            "mood": "determined",
            "status_effects": []
          }
        }
      },
      "node_0_1": {
        "story": "The distress signal is weak, corrupted by static and distance, but your rudimentary equipment manages to isolate a few key phrases: '...Imperial attack... Ryloth sector... need assistance... coordinates...' The signal abruptly cuts out, leaving you with a partial galactic coordinate and the chilling certainty that someone, somewhere, is in desperate trouble. Dust devils swirl around the rusted husk of the TIE fighter, and the twin suns of Ryloth beat down on your back. The decision of what to do next weighs heavily.",
        "is_end": false,
        "dialogue": "You continue to scavenge under Imperial rule, facing increasing oppression and resource scarcity. The seeds of doubt, however, are sown.",
        "scene_state": {
          "location": "unknown",
          "time_of_day": "day",
          "weather": "clear",
          "ambient": "mysterious"
        },
        "characters": {
          "player": {
            "health": 100,
            "mood": "determined",
            "status_effects": []
          }
        }
      },
      "node_0_2": {
        "story": "The datapad hums with static as you struggle to decipher the fragmented files. Imperial security protocols have corrupted most of the data, but you manage to isolate a few key fragments. One file details a hidden weapons cache located in the abandoned mines of Kessel Run. Another mentions a rendezvous point in the Outer Rim – coordinates that might lead you to the surviving members of the Rebel cell. The datapad flickers, almost dying, but you see an image of a familiar looking droid.",
        "is_end": false,
        "dialogue": "Your attempt to repair the transmitter attracts unwanted attention. An Imperial patrol is alerted to your location, and you must act quickly to evade capture.",
        "scene_state": {
          "location": "unknown",
          "time_of_day": "day",
          "weather": "clear",
          "ambient": "mysterious"
        },
        "characters": {
          "player": {
            "health": 100,
            "mood": "determined",
            "status_effects": []
          }
        }
      },
      "node_0_1_1": {
        "story": "The datapad flickers, spitting out lines of binary code. You recognize snippets of Imperial encryption algorithms mixed with something older, almost...forgotten. Hours blur as you painstakingly sift through the data, bypassing firewalls and piecing together fragments of information. Finally, a coherent message emerges: coordinates for a hidden hyperspace jump point and a cryptic reference to 'Project Stardust' near the Anoat system. A wave of heat washes over you as the datapad mentions something very specific, and horrifying - a group of Jedi prisoners forced to experiment for the Empire's plans. Time is running out.",
        "is_end": true,
        "dialogue": "Potentially alerts Imperial patrols to your location, but also might attract the attention of Rebel sympathizers. Time is of the essence.",
        "scene_state": {
          "location": "unknown",
          "time_of_day": "day",
          "weather": "clear",
          "ambient": "mysterious"
        },
        "characters": {
          "player": {
            "health": 100,
            "mood": "determined",
            "status_effects": []
          }
        }
      },
      "node_0_1_2": {
        "story": "The coordinates lead you to a desolate, rocky planet orbiting a binary sun. As your ship drops out of hyperspace, you're immediately assaulted by static interference, making communication nearly impossible. The surface below is scarred with deep canyons and littered with wreckage – signs of a fierce battle long past. Your sensors pick up faint energy signatures emanating from a hidden valley, shielded from orbital scans. The air is thick with the stench of ozone and decaying metal. You feel a palpable sense of dread, a lingering echo of violence that hangs heavy in the atmosphere.",
        "is_end": true,
        "dialogue": "Embarks you on a perilous journey across the harsh Ryloth landscape, towards an unknown conflict with limited resources and potential Imperial interception.",
        "scene_state": {
          "location": "unknown",
          "time_of_day": "day",
          "weather": "clear",
          "ambient": "mysterious"
        },
        "characters": {
          "player": {
            "health": 100,
            "mood": "determined",
            "status_effects": []
          }
        }
      },
      "node_0_2_1": {
        "story": "Dust motes dance in the flickering light of your glow rod. The cantina is a wreck. Tables are overturned, blaster marks scar the walls, and the air hangs heavy with the smell of burnt circuitry and spilled liquor. You methodically search the bodies, sifting through their belongings, hoping to find anything that sheds light on the recent Imperial attack and the whereabouts of the Rebel cell you're trying to contact. Most of the dead are just spacers and barflies, victims of circumstance. But one figure, slumped against the bar, catches your eye. He wears a worn leather jacket with a faded Rebel Alliance insignia. He's clutching a data stick in his hand.",
        "is_end": true,
        "dialogue": "Potential access to more detailed information about the Rebel cell and their plans, but increased risk of attracting Imperial attention.",
        "scene_state": {
          "location": "unknown",
          "time_of_day": "day",
          "weather": "clear",
          "ambient": "mysterious"
        },
        "characters": {
          "player": {
            "health": 100,
            "mood": "determined",
            "status_effects": []
          }
        }
      },
      "node_0_2_2": {
        "story": "The reek of spice hangs heavy in the Kessel air. You've managed to infiltrate the lower levels, a maze of processing plants and holding cells carved directly into the asteroid. The oppressive heat and the constant hum of machinery create a disorienting atmosphere. You're searching for any clue about increased Imperial activity, whispers of a new weapon, or even just signs of Rebel prisoners. Before you, a flickering light reveals two diverging tunnels. The first is marked with faded Imperial insignia, likely leading deeper into the mining operation. The second is a narrow, unlit passage, radiating a sense of illicit activity and the unmistakable aroma of smuggled goods.",
        "is_end": true,
        "dialogue": "Immediate access to potentially valuable weaponry and supplies, but you miss out on any further intel the datapad might hold about the Rebel cause.",
        "scene_state": {
          "location": "unknown",
          "time_of_day": "day",
          "weather": "clear",
          "ambient": "mysterious"
        },
        "characters": {
          "player": {
            "health": 100,
            "mood": "determined",
            "status_effects": []
          }
        }
      },
      "node_0_1_1_1": {
        "story": "Search the hyperspace to learn more about what's happening.",
        "is_end": true,
        "dialogue": "Potentially draws Rebel attention to your location; relinquishes direct control over immediate events but may yield quicker, larger-scale assistance.",
        "scene_state": {
          "location": "unknown",
          "time_of_day": "day",
          "weather": "clear",
          "ambient": "mysterious"
        },
        "characters": {
          "player": {
            "health": 100,
            "mood": "determined",
            "status_effects": []
          }
        }
      },
      "node_0_1_1_2": {
        "story": "Investigate a course to learn more about what's happening.",
        "is_end": true,
        "dialogue": "Provides you with immediate knowledge of the situation. However, without reinforcements, you are vulnerable to Imperial forces; may alert imperials of suspicious activity",
        "scene_state": {
          "location": "unknown",
          "time_of_day": "day",
          "weather": "clear",
          "ambient": "mysterious"
        },
        "characters": {
          "player": {
            "health": 100,
            "mood": "determined",
            "status_effects": []
          }
        }
      },
      "node_0_1_2_1": {
        "story": "Search the canyon to learn more about what's happening.",
        "is_end": true,
        "dialogue": "You risk a crash landing in the treacherous terrain but gain the element of surprise and a closer look at the source of the energy signatures.",
        "scene_state": {
          "location": "unknown",
          "time_of_day": "day",
          "weather": "clear",
          "ambient": "mysterious"
        },
        "characters": {
          "player": {
            "health": 100,
            "mood": "determined",
            "status_effects": []
          }
        }
      },
      "node_0_1_2_2": {
        "story": "Investigate a full-spectrum to learn more about what's happening.",
        "is_end": true,
        "dialogue": "You risk revealing your presence to anyone in the valley but gain valuable intelligence about potential threats and the layout of the area.",
        "scene_state": {
          "location": "unknown",
          "time_of_day": "day",
          "weather": "clear",
          "ambient": "mysterious"
        },
        "characters": {
          "player": {
            "health": 100,
            "mood": "determined",
            "status_effects": []
          }
        }
      },
      "node_0_2_1_1": {
        "story": "Search the data to learn more about what's happening.",
        "is_end": true,
        "dialogue": "You obtain the data stick. You'll need to find a terminal to access its contents, but it seems intact.",
        "scene_state": {
          "location": "unknown",
          "time_of_day": "day",
          "weather": "clear",
          "ambient": "mysterious"
        },
        "characters": {
          "player": {
            "health": 100,
            "mood": "determined",
            "status_effects": []
          }
        }
      },
      "node_0_2_1_2": {
        "story": "Search the cantina owner's office, hoping to find a hidden safe or a ledger detailing recent transactions. You suspect he may have been involved with the Rebels and could have stashed away valuable intelligence.",
        "is_end": true,
        "dialogue": "You find a hidden compartment under the floorboards. It contains a small cache of credits and a tattered map of the local star system with a specific location circled.",
        "scene_state": {
          "location": "unknown",
          "time_of_day": "day",
          "weather": "clear",
          "ambient": "mysterious"
        },
        "characters": {
          "player": {
            "health": 100,
            "mood": "determined",
            "status_effects": []
          }
        }
      },
      "node_0_2_2_1": {
        "story": "Follow the Imperial-marked tunnel, cautiously moving deeper into the mining operation to investigate the source of Imperial activity.",
        "is_end": true,
        "dialogue": "Face potential encounters with Imperial guards and increasing security measures as you delve further into the heart of the Kessel operation.",
        "scene_state": {
          "location": "unknown",
          "time_of_day": "day",
          "weather": "clear",
          "ambient": "mysterious"
        },
        "characters": {
          "player": {
            "health": 100,
            "mood": "determined",
            "status_effects": []
          }
        }
      },
      "node_0_2_2_2": {
        "story": "Investigate the unlit to learn more about what's happening.",
        "is_end": true,
        "dialogue": "Risk encountering dangerous underworld figures, but potentially gain access to intel the Empire doesn't want you to have.",
        "scene_state": {
          "location": "unknown",
          "time_of_day": "day",
          "weather": "clear",
          "ambient": "mysterious"
        },
        "characters": {
          "player": {
            "health": 100,
            "mood": "determined",
            "status_effects": []
          }
        }
      }
    },
    "edges": [
      {
        "from": "node_0",
        "to": "node_0_1"
      },
      {
        "from": "node_0",
        "to": "node_0_2"
      },
      {
        "from": "node_0_1",
        "to": "node_0_1_1"
      },
      {
        "from": "node_0_1",
        "to": "node_0_1_2"
      },
      {
        "from": "node_0_2",
        "to": "node_0_2_1"
      },
      {
        "from": "node_0_2",
        "to": "node_0_2_2"
      },
      {
        "from": "node_0_1_1",
        "to": "node_0_1_1_1"
      },
      {
        "from": "node_0_1_1",
        "to": "node_0_1_1_2"
      },
      {
        "from": "node_0_1_2",
        "to": "node_0_1_2_1"
      },
      {
        "from": "node_0_1_2",
        "to": "node_0_1_2_2"
      },
      {
        "from": "node_0_2_1",
        "to": "node_0_2_1_1"
      },
      {
        "from": "node_0_2_1",
        "to": "node_0_2_1_2"
      },
      {
        "from": "node_0_2_2",
        "to": "node_0_2_2_1"
      },
      {
        "from": "node_0_2_2",
        "to": "node_0_2_2_2"
      }
    ]
  }
}